In [3]:
import numpy as np
import pandas as pd

data = {
    "id": [101, 102, 103, 104, 105, 106],
    "name": ["John", "Dan", "James", "Amy", "Anne", "Ron"],
    "department": ["A", "A", "A", "A", "A", "B"],
    "managerId": [np.nan, 101, 101, 101, 101, 101],
}

employee = pd.DataFrame(data)

In [13]:
uniq_manager_id = list(set(employee.dropna()["managerId"]))

morethan = []

for u in uniq_manager_id:
    empcount = list(employee.dropna()["managerId"]).count(u)
    if empcount >= 5:
        manager_name = employee[employee["id"] == u]["name"]
        morethan.append(manager_name)

cdict = {"name": morethan}
cmndf = pd.DataFrame(cdict, index=[0])
print(cmndf)

                                  name
0  0    John
Name: name, dtype: object

In [12]:
print(cmndf.columns)

Index(['name'], dtype='object')

# Accepted answer

The approach above likely worked, but the solution was not accepted by Leetcode, despite being exactly the same in the first test case. This more elegant solution was found on the website.

In [6]:
pd.merge(
    employee,
    employee["managerId"].value_counts(),
    how="left",
    left_on="id",
    right_on="managerId",
)

    id   name department  managerId  count
0  101   John          A        NaN    5.0
1  102    Dan          A      101.0    NaN
2  103  James          A      101.0    NaN
3  104    Amy          A      101.0    NaN
4  105   Anne          A      101.0    NaN
5  106    Ron          B      101.0    NaN